/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyeonsok <hyeonsok@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/03 20:26:40 by hyeonsok          #+#    #+#             */
/*   Updated: 2021/04/03 22:13:27 by hyeonsok         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	int  res;

	지정해둔 문자중 어느곳도 포함되지 않을때
	알파벳을 만났는데 올바르게 움직이지 않을 때,,
	width나 precision은 정상적으로 작동하는 것 처럼 보인다.
	printf("%12      \n             a\n", 9);
	printf("%12                   w\n", 9);
	printf("%12                  l@k\n", 9);
	printf("%12                   k\n", 9);

	printf("%12                   a\n", 9);
	printf("%12ww\n", 9);
	printf("%12                  l@k\n", 9);
	printf("%12                   k\n", 9);

	return (0);
}

// 유효하지 않은 플래그에 대해서는 스킵해서 생각한다.
// 지정하지 않은 경